# Blueprint Laporan: Menyusun Dataset Sampel Arbitrase Polymarket vs Kalshi (Event Crypto/Politik)

## Pendahuluan dan Tujuan
Laporan ini disusun untuk memandu pembuatan dataset sampel arbitrase historis antara Polymarket dan Kalshi atas event crypto dan politik. Tujuan utamanya adalah menyajikan kerangka data, metodologi, dan formula yang digunakan untuk mengidentifikasi peluang arbitrase, menghitung profit, serta menetapkan optimal bet amount (jumlah taruhan optimal) dalam setting dwihak (two-outcome). Hasil akhir yang ditargetkan adalah file JSON terstandar yang mudah diintegrasikan ke pipeline analitik, yaitu data/sample_arbitrage_history.json, serta struktur direktori yang rapi untuk menghindari konflik lintas tugas.

Ruang lingkup laporan meliputi: (i) definisi variabel dan formula inti, (ii) skenario arbitrase yang realistis, (iii) konvensi timestamp, mata uang, dan parameter, (iv) rancangan skema JSON dengan contoh per record, (v) metodologi komputasi profit dan ukuran sampel, serta (vi) pengendalian kualitas, risiko, dan langkah validasi. Pada akhirnya, dataset ini diharapkan menjadi baseline replikabel untuk analisis deskriptif peluang arbitrase sederhana, tanpa menggunakan data pasar nyata.

### Definisi Operasional dan Batasan
- Event crypto merujuk pada pasar dua hasil (yes/no) yang harga probabilitasnya muncul di kedua platform. Event politik mengikuti definisi serupa.
- Dwyihak diasumsikan lengkap, yaitu tidak ada kemungkinan ketiga (misalnya “No Contest” tidak dipertimbangkan). Harga adalah probabilitas implisit pasar terhadap hasil “Yes”.
- Nilai “Yes” dinormalisasi pada rentang [0, 1]. Arbitrase terjadi ketika dua harga untuk event yang sama tidak identik; peluang muncul dari spread harga dan arah pemilihan sisi (long/short) yang tepat.
- Dataset bersifat sampel sintetis yang disusun sesuai praktik ter Healthy namun tidak menggunakan catatan market nyata. Harap catat perbedaan konvensi antara platform saat implementasi.

### Catatan Konvensi Platform
- Polymarket: biasanya menggunakan报价 desimal dalam rentang [0, 1] untuk probabilitas “Yes”.
- Kalshi: lazim menampilkan harga dalam dolar AS per kontrak (misalnya 0,65 USD). Untuk mengonversi ke probabilitas implisit “Yes”, gunakan konvensi: p = harga_USD / 100. Konvensi ini diasumsikan konsisten untuk kontrak dwihak yang dipertimbangkan dalam sampel.
- Konversi mata uang: semua nilai dolar diasumsikan USD; tidak ada penyesuaian kurs lintas mata uang dalam dataset ini.

## Kerangka Teoretis Arbitrase Dua-Platform
Di pasar dwihak, setiap event memiliki harga yang menunjukkan probabilitas implisit dari hasil “Yes”. Jika harga di dua platform berbeda, terdapat peluang arbitrase. Konsep kunci meliputi:

- Harga desimal p_polymarket ∈ [0, 1] untuk “Yes”.
- Harga USD per kontrak k_kalshi ∈ [0, 100] untuk “Yes”; probabilitas implisit p_kalshi = k_kalshi / 100.
- Arbitrage flag muncul jika |p_high − p_low| > 0 (yaitu harga tidak identik), dengan arah: Long pada platform dengan p lebih rendah dan Short pada platform dengan p lebih tinggi.
- Asumsi no-friction: tanpa biaya transaksi, slippage, atau batas likuiditas. Dalam praktik, semua faktor ini memengaruhi profit dan eksekusi.

Untuk memandu komputasi, Tabel 1 merangkum formula inti yang digunakan.

### Tabel 1. Ringkasan Formula Komputasi
| Variabel/Formula | Definisi/Rumus | Penjelasan |
|---|---|---|
| p_poly | Harga probabilitas “Yes” Polymarket | Nilai desimal 0–1 |
| p_kalshi | k_kalshi / 100 | Konversi USD ke probabilitas implisit “Yes” |
| p_low | min(p_poly, p_kalshi) | Harga lebih rendah |
| p_high | max(p_poly, p_kalshi) | Harga lebih tinggi |
| Arbitrage flag | (p_high − p_low) > 0 | True jika spread > 0 |
| Expected value (EV) | p_low − p_high | Selisih probabilitasImplisit “low” vs “high” |
| Max EV (%) | EV × 100 | EV dinyatakan dalam persentase |
| EV_yes_L | p_low − p_high | EV jika Long “Yes” di sisi harga rendah |
| EV_yes_H | p_high − p_low | EV jika Short “Yes” di sisi harga tinggi |
| EV_no_L | (1 − p_low) − (1 − p_high) = p_high − p_low | EV jika Long “No” di sisi harga rendah |
| EV_no_H | (1 − p_high) − (1 − p_low) = p_low − p_high | EV jika Short “No” di sisi harga tinggi |
| Profit_yes_low(B) | (p_low − p_high) × B | Profit bersih Long “Yes” di sisi rendah dengan modal B |
| Profit_yes_high(B) | (p_high − p_low) × (−B) | Profit bersih Short “Yes” di sisi tinggi (arah investasi negatif) |
| Optimal bet (B*) | B_total × p_high | Alokasi optimal under no-friction untuk hedged portfolio |

Catatan penting: profit dihitung dengan asumsi tidak ada biaya, slippage, atau batasan likuiditas. EV maksimal absolut dalam dataset dibatasi hingga 10% untuk menjaga sifat sintetis dan proporsional.

### Asumsi No-Friction
Tanpa biaya transaksi dan slippage, spread antara dua harga sepenuhnya tercermin dalam profit/rugi portofolio yang di-hedge. Implikasi praktisnya: profit arbitrase sepenuhnya berasal dari perbedaan probabilitas implisit. Batasan eksekusi yang umum (seperti ukuran kontrak minimum, spread bid–ask, atau dana yang tidak cukup) tidak dimodelkan di sini. Konsekuensinya, hasil di dunia nyata dapat bervariasi karena friksi pasar.

## Sumber Data, Validasi, dan Ruang Lingkup Sampel
Dataset ini bersifat sintetis. Pemilihan event dan harga mengikuti pola yang umum ditemukan: berita penting yang berdampak pada sentimen, peristiwa kalender politik/regulasi, dan dinamika adopsi aset kripto. Validasi dilakukan melalui konsistensi format harga, range [0,1], dan kelengkapan field. Karena tidak ada sumber pihak ketiga, tidak ada referensi publik yang dikutip.

### Metode Penyusunan Event dan Harga
Event dipilih dari tema crypto (misalnya&colon; adopsiETF Bitcoin, regulasi stablecoin, tren NFT) dan politik (misalnya&colon; pengendalian inflasi, kebijakan suku bunga). Harga disusun agar mencerminkan spread realistis yang menghasilkan EV absolut sampai 10%, menjaga agar sampel tampak masuk akal tanpa menggantungkan diri pada data live. Waktu dipilih berurutan dalam beberapa bulan terakhir dan dikonversi ke UTC.

### Variasi Harga yang Wajar
Spread harga antar platform bervariasi mengikuti:
- Likuiditas relatif antar platform.
- Perbedaan interpretasi berita atau risiko regulasi.
- Ketersediaan informasi pada saat tertentu (misalnya sebelum/keputusan policy).
Konsekuensinya adalah EV sintetis yang terdistribusi dengan rentang yang proporsional terhadap perubahan sentimen tipikal di kedua pasar.

## Skema Data dan Konvensi Penamaan
Skema data dirancang ringkas namun informatif. File JSON akhir berada di data/sample_arbitrage_history.json, terdiri dari array record event. Setiap record memuat metadata event, harga di masing-masing platform, hasil komputasi arbitrase, dan parameter yang digunakan.

### Tabel 2. Skema Field JSON
| Nama Field | Deskripsi | Tipe Data | Contoh |
|---|---|---|---|
| id | Pengenal unik event | string | "evt_001" |
| timestamp_iso | waktu event (UTC) ISO-8601 | string | "2025-08-12T14:15:00Z" |
| platform | sumber harga (Polymarket atau Kalshi) | string | "Polymarket" |
| market_name | nama event | string | "Adopsi ETF Bitcoin sebelum Q4 2025?" |
| category | kategori event (crypto/politics) | string | "crypto" |
| outcome | hasil yang dipertanggungkan | string | "Yes" |
| price | harga platform untuk outcome | number | 0.67 |
| unit | satuan harga (USD atau probability) | string | "USD" |
| currency | mata uang (USD) | string | "USD" |
| ev_max_pct | EV maksimum absolut (0–10%) | number | 5 |
| notes | catatan singkat | string | "Spread sintetis ±5%" |
| calc_spread | selisih harga (p_high − p_low) | number | 0.05 |
| arb_direction | arah arbitrase | string | "Long Low / Short High" |
| optimal_bet_usd | jumlah USD optimal (B*) | number | 1350 |
| profit_pct | profit terhadap modal | number | 0.025 |
| profit_usd | profit USD terhadap modal | number | 33.75 |
| profit_formula | ringkasan formula | string | "(p_low − p_high) × B" |

### Struktur Direktori
- Semua file diletakkan di bawah direktori docs/research/ untuk menghindari konflik lintas tugas.
- File JSON final berada di docs/research/data/sample_arbitrage_history.json.
- Direktori kerja default adalah /workspace; struktur lokal dapat bervariasi antar environment eksekusi.

### Normalisasi Harga dan Unit
- Polymarket&colon; price dinormalisasi ke [0,1] untuk “Yes”.
- Kalshi&colon; price_USD per kontrak dikonversi ke probabilitas “Yes” menggunakan p = price_USD / 100.
- Konversi mata uang&colon; diasumsikan USD di semua platform; tidak ada selisih kurs lintas mata uang.

## Metodologi Penghitungan Arbitrase dan Optimal Bet
Empat langkah inti:
1) Hitung probabilitas implisit “Yes” di setiap platform (p_poly, p_kalshi).
2) Tentukan p_low dan p_high; set arb_direction = “Long Low / Short High”.
3) Hitung EV = p_low − p_high (signed). Profit persentase profit_pct = EV.
4) Tetapkan optimal bet amount B* = B_total × p_high. Profit USD dihitung sebagai profit_usd = B_total × profit_pct.

Untuk memandu implementasi, lihat ringkasan komputasi di Tabel 3.

### Tabel 3. Ringkasan Komputasi
| Field Output | Rumus/Deskripsi |
|---|---|
| calc_spread | p_high − p_low |
| arb_direction | “Long Low / Short High” |
| ev_max_pct | max(|EV| × 100, tetap ≤ 10) |
| optimal_bet_usd | B_total × p_high |
| profit_pct | EV |
| profit_usd | B_total × EV |
| profit_formula | “p_low − p_high dikali modal” |

Asumsi kunci:
- Tanpa friksi (biaya/slippage/limitasi likuiditas).
- Dwyihak lengkap.
- EV maksimal absolut dibatasi 10% untuk menjaga realisme sampel.

### Penentuan Arah Arbitrase
- Long pada harga rendah, Short pada harga tinggi. Untuk “Yes”, Long ketika p_low dan Short ketika p_high. Untuk “No”, Long pada sisi harga rendah (menyatakan probabilitas “No” lebih tinggi di sisi rendah) dan Short pada sisi harga tinggi. Rumus EV berubah tanda bergantung pada outcome, namun struktur arah investasi tetap: Long sisi rendah, Short sisi tinggi.

### Handling Fees dan Batasan Eksekusi
Dalam dataset ini, semua biaya diabaikan. Dalam penerapan nyata, fees, spread bid–ask, dampak likuiditas, dan batasan eksekusi harus dikurangkan dari profit sebelum keputusan eksekusi. Penyesuaian tersebut dapat mengubah B*, arah implikasi, atau bahkan meniadakan peluang jika biaya menutupi EV.

## Skenario Sampel dan Insersi Data
Sebanyak 20+ record contoh disusun dengan rentang waktu dari Mei–November 2025 (UTC). Setiap record merepresentasikan perubahan harga sintetis yang menghasilkan spread arbitrase yang masuk akal dan EV absolut hingga 10%. Event crypto dan politik diwarnai oleh narasi yang umum&colon; adopsi ETF, regulasi stablecoin, kebijakan fiskal dan moneter, serta dinamika NFT.

Untuk menautkan narasi ke angka, Tabel 4 memetakan tema ke harga dan estimasi EV sintetis. Tabel ini bukan bagian dari file JSON&COLON; ini adalah panduan naratif agar pembaca memahami konteks komputasi.

### Tabel 4. Pemetaan Event → Harga → EV Maksimum (sintetis)
| Event | Platform | Outcome | Harga | Konversi | EV Maks (sintetis) |
|---|---|---|---|---|---|
| Adopsi ETF Bitcoin sebelum Q4 2025? | Polymarket | Yes | 0.67 | — | 5% |
|  | Kalshi | Yes | 0.72 USD → 0.72 | p_kalshi = 0.72 |  |
| Regulasi Stablecoin USDT/USDC di AS tahun 2025? | Polymarket | Yes | 0.58 | — | 6% |
|  | Kalshi | Yes | 0.64 USD → 0.64 | p_kalshi = 0.64 |  |
| Bitcoin melewati $100k sebelum 31 Des 2025? | Polymarket | Yes | 0.40 | — | 4% |
|  | Kalshi | Yes | 0.44 USD → 0.44 | p_kalshi = 0.44 |  |
| ETH 2.0 menyelesaikan transisi sebelum Okt 2025? | Polymarket | Yes | 0.30 | — | 3% |
|  | Kalshi | Yes | 0.33 USD → 0.33 | p_kalshi = 0.33 |  |
| Adopsi NFT kembali naik pada Q3 2025? | Polymarket | Yes | 0.52 | — | 4% |
|  | Kalshi | Yes | 0.56 USD → 0.56 | p_kalshi = 0.56 |  |
| Fed menurunkan suku bunga di Nov 2025? | Polymarket | Yes | 0.35 | — | 5% |
|  | Kalshi | Yes | 0.40 USD → 0.40 | p_kalshi = 0.40 |  |
| Inflasi AS turun di bawah 3% YoY pada Okt 2025? | Polymarket | Yes | 0.62 | — | 4% |
|  | Kalshi | Yes | 0.66 USD → 0.66 | p_kalshi = 0.66 |  |
| Republicans保持 majority di House setelah midterms 2025? | Polymarket | Yes | 0.48 | — | 4% |
|  | Kalshi | Yes | 0.52 USD → 0.52 | p_kalshi = 0.52 |  |

Interpretasi: setiap pasangan harga menghasilkan spread kecil namun enough untuk mengilustrasikan arbitrase under no-friction. EV maksimal dibatasi ≤10% agar tetap realistis dan sesuai spirit data sampel.

### Contoh Per Record (pseudodata)
Berikut contoh 12 record yang menampilkan rentang EV. Tabel 5 disusun sebagai preview ringkas; implementasi penuh dalam file JSON (data/sample_arbitrage_history.json) menggunakan timestamp ISO-8601 (UTC) dan harga hasil konversi.

### Tabel 5. Tabel Preview 12 Record
| id | timestamp_iso | platform | market_name | category | outcome | price | unit | p_converted | calc_spread | arb_direction | ev_max_pct | optimal_bet_usd | profit_pct | profit_usd | notes |
|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|
| evt_001 | 2025-08-12T14:15:00Z | Polymarket | Adopsi ETF Bitcoin sebelum Q4 2025? | crypto | Yes | 0.67 | probability | 0.67 | 0.05 | Long Low / Short High | 5 | 1800 | 0.05 | 90.00 | Spread sintetis ±5% |
| evt_002 | 2025-08-12T14:15:00Z | Kalshi | Adopsi ETF Bitcoin sebelum Q4 2025? | crypto | Yes | 72 | USD | 0.72 | 0.05 | Long Low / Short High | 5 | 1800 | 0.05 | 90.00 | Konversi p=USD/100 |
| evt_003 | 2025-08-21T09:00:00Z | Polymarket | Regulasi Stablecoin USDT/USDC di AS 2025? | crypto | Yes | 0.58 | probability | 0.58 | 0.06 | Long Low / Short High | 6 | 1200 | 0.06 | 72.00 | Spread sintetis ±6% |
| evt_004 | 2025-08-21T09:00:00Z | Kalshi | Regulasi Stablecoin USDT/USDC di AS 2025? | crypto | Yes | 64 | USD | 0.64 | 0.06 | Long Low / Short High | 6 | 1200 | 0.06 | 72.00 | p_kalshi=0.64 |
| evt_005 | 2025-09-05T16:30:00Z | Polymarket | BTC > $100k sebelum 31 Des 2025? | crypto | Yes | 0.40 | probability | 0.40 | 0.04 | Long Low / Short High | 4 | 900 | 0.04 | 36.00 | Spread sintetis ±4% |
| evt_006 | 2025-09-05T16:30:00Z | Kalshi | BTC > $100k sebelum 31 Des 2025? | crypto | Yes | 44 | USD | 0.44 | 0.04 | Long Low / Short High | 4 | 900 | 0.04 | 36.00 | p_kalshi=0.44 |
| evt_007 | 2025-09-22T11:45:00Z | Polymarket | ETH 2.0 selesai sebelum Okt 2025? | crypto | Yes | 0.30 | probability | 0.30 | 0.03 | Long Low / Short High | 3 | 600 | 0.03 | 18.00 | Spread sintetis ±3% |
| evt_008 | 2025-09-22T11:45:00Z | Kalshi | ETH 2.0 selesai sebelum Okt 2025? | crypto | Yes | 33 | USD | 0.33 | 0.03 | Long Low / Short High | 3 | 600 | 0.03 | 18.00 | p_kalshi=0.33 |
| evt_009 | 2025-10-03T13:10:00Z | Polymarket | NFT naik Q3 2025? | crypto | Yes | 0.52 | probability | 0.52 | 0.04 | Long Low / Short High | 4 | 1500 | 0.04 | 60.00 | Spread sintetis ±4% |
| evt_010 | 2025-10-03T13:10:00Z | Kalshi | NFT naik Q3 2025? | crypto | Yes | 56 | USD | 0.56 | 0.04 | Long Low / Short High | 4 | 1500 | 0.04 | 60.00 | p_kalshi=0.56 |
| evt_011 | 2025-10-21T15:00:00Z | Polymarket | Fed memotong suku bunga Nov 2025? | politics | Yes | 0.35 | probability | 0.35 | 0.05 | Long Low / Short High | 5 | 2000 | 0.05 | 100.00 | Spread sintetis ±5% |
| evt_012 | 2025-10-21T15:00:00Z | Kalshi | Fed memotong suku bunga Nov 2025? | politics | Yes | 40 | USD | 0.40 | 0.05 | Long Low / Short High | 5 | 2000 | 0.05 | 100.00 | p_kalshi=0.40 |

Interpretasi: setiap event di atas dicatat pada dua platform dalam satu timestamp UTC. Selisih harga menghasilkan EV kecil namun positif yang bila di-hedge sepenuhnya akan memberikan profit terhadap modal under asumsi no-friction. Angka optimal_bet_usd pada baris dengan platform arbitraging low adalah B_total × p_high; baris counterpart (platform tinggi) tetap ditampilkan untuk konsistensi namun arah investasinya shortsighted dan menghasilkan profit negatif jika dikelola单独.

#### Event Crypto
Kelima event crypto memberi representasi dinamika pasar yang sering mendorong spread sintetis: adopsi ETF, regulasi stablecoin, puncak siklus mata uang kripto (BTC > $100k), milestone teknologi (ETH 2.0), dan sentimen spekulatif (NFT). Harga disusun agar spread berada pada rentang 3–6%.

#### Event Politik
 Event politik dipilih untuk mencerminkan kebijakan moneter dan fiskal. Fed dan inflasi adalah dua penentu utama risiko/harapan, sementara mayoritas house mempengaruhi tone kebijakan. Dalam sampel, spread sintetis dibuat pada rentang 3–5%.

## Hasil, Penafsiran, dan Analisis Sederhana
Dataset sampel menampilkan EV maksimum yang terdistribusi kecil hingga sedang (3–6%), dengan beberapa instance hingga 10%. Variasi harga antar platform muncul dari perbedaan interpretasi berita dan likuiditas, yang secara natural menghasilkan spread kecil namun berulang. Di bawah asumsi no-friction, semua spread menghasilkan profit saat di-hedge sempurna, tetapi friksi pasar nyata akan menurunkan atau menghapus profit tersebut.

Untuk membantu penafsiran, Tabel 6 menyajikan ringkasan deskriptif EV sintetis.

### Tabel 6. Distribusi EV Maksimum (Sintetis)
| Statistik | EV_max_pct |
|---|---|
| Rata-rata | 4.4% |
| Median | 4.0% |
| Minimum | 3.0% |
| Maksimum | 6.0% |
| Standar Deviasi | 1.2% |

Interpretasi: EV yang umumnya kecil menunjukkan arbitrase yang tipis namun sering, yang konsisten dengan pasar dwihak ketika informasi belum resueltif. Faktor friksi dapat meniadakan profit; nilai EV 3–6% memberi cushion moderat bila biaya eksekusi rendah dan likuiditas memadai.

### Implikasi Operasional
- Eksekusi arbitrase membutuhkan kecepatan: spread dapat berubah cepat ketika berita terkini masuk.
- Likuiditas per platform menentukan kemampuan masuk/keluar tanpa biaya tersembunyi (slippage).
- Friksi seperti biaya transaksi dan spread bid–ask perlu diperhitungkan; tanpa koreksi, profit sintetis dapat berkurang signifikan.

## Kontrol Kualitas, Risiko, dan Kepatuhan
Kontrol kualitas difokuskan pada validasi format harga, range [0,1], konsistensi timestamp ISO-8601 (UTC), serta kelengkapan field inti. Risiko mencakup misinterpretasi konvensi harga, asumsi no-friction, dan penggunaan data sintetis. Kepatuhan menuntut tidak menyatakan bahwa dataset ini berasal dari data pasar nyata.

### Validasi Skema
- Tipe data sesuai (number untuk price dan p_converted; string untuk timestamp_iso).
- Rentang p_converted dibatasi [0,1].
- Timestamp harus valid ISO-8601 dan dalam UTC.
- Field “unit” konstan&colon; “probability” untuk Polymarket, “USD” untuk Kalshi.
- Harga pada Kalshi harus berada dalam [0,100] sesuai kontrak dwihak standar; konversi p = price_USD / 100.

### Asumsi dan Batasan
- Tanpa friksi.
- Event dwihak lengkap; tidak ada hasil lain.
- Tidak menggunakan data pasar aktual.
- Konversi Kalshi ke probabilitas mengikuti asumsi umum; verifikasi diperlukan saat integrasi.
- Tidak ada referensi pihak ketiga atau sumber eksternal.

## Rencana Penyimpanan, Pengiriman, dan Validasi Akhir
- Lokasi file final: docs/research/data/sample_arbitrage_history.json.
- File terdiri dari array objek berformat sesuai Tabel 2; setiap event diwakili oleh record lengkap, termasuk harga dari kedua platform dan hasil komputasi.
- Proses validasi mencakup cek tipe data, range harga, konsistensi format timestamp, serta uji formula komputasi arbitrase per record.

### Checklist Akhir
- Lokasi file sesuai direktori yang disepakati.
- Penamaan field konsisten; tidak ada nilai kosong pada field wajib.
- Formula arbitrase diterapkan konsisten di seluruh dataset.
- Asumsi no-friction dan dwihak dinyatakan jelas dalam dokumentasi.
- Preview tabel selaras dengan isi file JSON; contoh record memuat nilai representatif untuk rentang EV sintetis yang diinginkan.

## Informasi yang Belum Tersedia (Information Gaps)
- Tidak tersedia data historis aktual dari Polymarket dan Kalshi&COLON; dataset ini sepenuhnya sintetis.
- Konvensi unit dan fmt harga Kalshi (USD per kontrak) diasumsikan; verifikasi diperlukan saat implementasi.
- Tidak ada dokumentasi sumber eksternal untuk mendukung angka tertentu; keputusan harga sepenuhnya berbasis skenario.
- Parameter eksekusi nyata (biaya, slippage, batas likuiditas) tidak dimodelkan.

## Lampiran: Pseudocode dan Pemetaan ke JSON
Sebagai panduan implementasi, pseudocode berikut merangkum alur perhitungan:

```
for each event_id:
  fetch record_poly with timestamp_iso, price_poly (probability), outcome='Yes'
  fetch record_kalshi with same event_id and timestamp_iso, price_usd, outcome='Yes'

  p_poly = price_poly
  p_kalshi = price_usd / 100.0

  p_low = min(p_poly, p_kalshi)
  p_high = max(p_poly, p_kalshi)
  calc_spread = p_high - p_low

  EV = p_low - p_high
  ev_max_pct = min(abs(EV) * 100, 10.0)

  B_total = 10000.0  # contoh modaltotal
  B_optimal = B_total * p_high

  profit_pct = EV
  profit_usd = B_total * EV
  arb_direction = "Long Low / Short High"

  write JSON record:
    id, timestamp_iso, platform, market_name, category, outcome, price, unit, currency,
    p_converted, calc_spread, arb_direction, ev_max_pct, optimal_bet_usd, profit_pct, profit_usd, profit_formula
```

Contoh single-line JSON (format ringkas untuk satu record):

```json
{"id":"evt_001","timestamp_iso":"2025-08-12T14:15:00Z","platform":"Polymarket","market_name":"Adopsi ETF Bitcoin sebelum Q4 2025?","category":"crypto","outcome":"Yes","price":0.67,"unit":"probability","currency":"USD","p_converted":0.67,"calc_spread":0.05,"arb_direction":"Long Low / Short High","ev_max_pct":5,"optimal_bet_usd":1800,"profit_pct":0.05,"profit_usd":90.00,"profit_formula":"(p_low − p_high) × B"}
```

Catatan implementasi:
- Semua record timestamps dalam UTC ISO-8601.
- Price unit: “probability” untuk Polymarket, “USD” untuk Kalshi.
- EV maksimal absolut dibatasi ≤ 10%.
- Optimal bet amount dihitung dengan B_total × p_high pada sisi arbitraging rendah.

## Penutup
Blueprint ini mengoperasionalkan konsep arbitrase dwihak antara dua platform dengan asumsi sederhana namun powerful: tidak ada friksi dan event sempurna dua hasil. Skema JSON yang diusulkan cukup ringkas untuk integrasi, sekaligus memuat metrik komputasi arbitrase yang penting (EV, profit, optimal bet). Skenario sintetis disusun agar mencerminkan spread realistis 3–6% (dan hingga 10% pada kasus tertentu), dengan contoh data preview yang mudah ditautkan ke narasi pasar. Dengan pengendalian kualitas yang ketat dan dokumentasi asumsi yang jelas, dataset ini diharapkan dapat menjadi titik awal yang solid untuk eksplorasi deskriptif peluang arbitrase, serta dasar pengujian strategi yang lebih realistis ketika friksi pasar dan likuiditas diperhitungkan.