📄 Extracted from page: GambitAI
URL: https://rukhehgidogb.space.minimax.io/contact

Extracted content:
```json
{
  "title": "GambitAI",
  "url": "https://rukhehgidogb.space.minimax.io/contact",
  "summary": "This page serves as the contact hub for GambitAI, an AI-powered arbitrage detection platform. It features a contact form for users to send messages, provides various contact methods including email (support@gambitai.com with a 24-hour response time), live chat (available on the dashboard, Monday-Friday, 09:00-18:00), and office information (Jakarta, Indonesia, by appointment). The page also lists general operating hours, details on enterprise solutions, and a FAQ section covering topics like getting started, trial periods, supported platforms, and data security. There are no explicit success, notification, or confirmation messages displayed on the page content provided for form submissions.",
  "key_points": [
    "Contact Us page for GambitAI.",
    "Includes a 'Send Message' form requiring Full Name, Email, Subject, and Message fields.",
    "Email contact: support@gambitai.com, with a promised response within 24 hours.",
    "Live Chat available on the dashboard, Monday - Friday, 09:00 - 18:00.",
    "Office located in Jakarta, Indonesia, by appointment only.",
    "General operating hours: Monday - Friday (09:00 - 18:00), Saturday (10:00 - 15:00), Sunday (Closed).",
    "Section for Enterprise Solutions, directing users to 'View Enterprise Plans'.",
    "FAQ section addressing: How to get started, trial period availability (Free plan forever, no credit card), supported platforms (Polymarket, Kalshi, with expansion plans), and data security (end-to-end encryption, secure servers, routine backups).",
    "No explicit success messages, notifications, or confirmation messages regarding form submission were found on the page content."
  ],
  "relevant_links": [
    {"text": "GambitAI", "url": "/"},
    {"text": "Home", "url": "/"},
    {"text": "About", "url": "/about"},
    {"text": "Pricing", "url": "/pricing"},
    {"text": "Sign In", "url": "/login"},
    {"text": "Get Started", "url": "/signup"},
    {"text": "View Enterprise Plans", "url": "/pricing"},
    {"text": "Dashboard", "url": "/login"},
    {"text": "Pricing", "url": "/pricing"},
    {"text": "Sign Up", "url": "/signup"},
    {"text": "About Us", "url": "/about"},
    {"text": "Contact", "url": "/contact"},
    {"text": "Privacy Policy", "url": "/privacy"},
    {"text": "Terms of Service", "url": "/terms"}
  ],
  "file_name": "gambitai_contact_page.json"
}
```
